In [3]:
import numpy as np
import pandas as pd

# Link

https://data.boston.gov/dataset/hubway-stations/resource/ca171349-c7b2-49e3-bb1b-04836ac72559

In [4]:
df = pd.read_csv('data/Hubway_Stations.csv')

In [5]:
df.head()

,X,Y,OBJECTID,id,name,lat,long,nbBikes,nbEmptyDocks,latestUpdateTime
0,-71.100619,42.340115,1329,3,Colleges of the Fenway - Fenway at Avenue Loui...,NaN,NaN,NaN,NaN,NaN
1,-71.069616,42.345392,1330,4,Tremont St at E Berkeley St,NaN,NaN,NaN,NaN,NaN
2,-71.090179,42.341814,1331,5,Northeastern University - North Parking Lot,NaN,NaN,NaN,NaN,NaN
3,-71.065210,42.361304,1332,6,Cambridge St at Joy St,NaN,NaN,NaN,NaN,NaN
4,-71.043885,42.352941,1333,7,Fan Pier,NaN,NaN,NaN,NaN,NaN

In [7]:
df = df[['X','Y']]

In [8]:
df.head()

           X          Y
0 -71.100619  42.340115
1 -71.069616  42.345392
2 -71.090179  42.341814
3 -71.065210  42.361304
4 -71.043885  42.352941